org/holy/avg.org
#+STARTUP: showall indent hidestars

* Lisp: побеждая посредственность

Летом 1995 года мой друг Роберт Моррис и я основали компанию под названием Viaweb. Наш
план заключался в разработке программного обеспечения, которое позволило бы
пользователю создавать свой онлайновый магазин. Новизна этого софта на тот момент
заключалась в том, что он работал на сервере, используя web-страницы как интерфейс.

У многих в то время была та же идея, но, насколько я знаю, Viaweb была первым
web-приложением. Идея показалась нам настолько новой, что название для компании мы
придумали так, чтобы оно отражало ее суть — Viaweb ("Через web"), подчеркивало, что
программа работает в Сети, а не на локальном компьютере.

Другая особенность нашего софта заключалась в том, что он был написан на языке
программирования Lisp.

Viaweb вначале состоял из двух частей: редактора, написанного на Lisp'е, который
использовался для построения сайтов, и системы обработки заказов, написанной на
C. Большую часть первой версии составлял Lisp, так как система обработки заказов была
маленькая. Позже мы добавили еще два модуля, генератор изображений на C, и программу
для администрирования, написанную большей частью на Perl'е.

Это была одна из первых больших пользовательских программ на Lisp, который прежде
использовался в основном в университетах и исследовательских лабораториях. Lisp дал нам
большое преимущество перед нашими конкурентами, которые применяли менее мощные языки.

