www/holy/avg.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org77e96fd">Lisp: побеждая посредственность</a>
<ul>
<li><a href="#org13ef685">Cекретное оружие</a></li>
<li><a href="#org787a25a">Парадокс Блаба</a></li>
<li><a href="#org7c4c861">Айкидо для начинающих компаний</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org77e96fd" class="outline-2">
<h2 id="org77e96fd">Lisp: побеждая посредственность</h2>
<div class="outline-text-2" id="text-org77e96fd">
<p>
Летом 1995 года мой друг Роберт Моррис и я основали компанию под названием Viaweb. Наш
план заключался в разработке программного обеспечения, которое позволило бы
пользователю создавать свой онлайновый магазин. Новизна этого софта на тот момент
заключалась в том, что он работал на сервере, используя web-страницы как интерфейс.
</p>

<p>
У многих в то время была та же идея, но, насколько я знаю, Viaweb была первым
web-приложением. Идея показалась нам настолько новой, что название для компании мы
придумали так, чтобы оно отражало ее суть — Viaweb ("Через web"), подчеркивало, что
программа работает в Сети, а не на локальном компьютере.
</p>

<p>
Другая особенность нашего софта заключалась в том, что он был написан на языке
программирования Lisp.
</p>

<p>
Viaweb вначале состоял из двух частей: редактора, написанного на Lisp'е, который
использовался для построения сайтов, и системы обработки заказов, написанной на
C. Большую часть первой версии составлял Lisp, так как система обработки заказов была
маленькая. Позже мы добавили еще два модуля, генератор изображений на C, и программу
для администрирования, написанную большей частью на Perl'е.
</p>

<p>
Это была одна из первых больших пользовательских программ на Lisp, который прежде
использовался в основном в университетах и исследовательских лабораториях. Lisp дал нам
большое преимущество перед нашими конкурентами, которые применяли менее мощные языки.
</p>
</div>
