www/holy/avg.html

<div id="outline-container-org13ef685" class="outline-3">
<h3 id="org13ef685">Cекретное оружие</h3>
<div class="outline-text-3" id="text-org13ef685">
<p>
Эрик Реймонд (Eric Raymond) написал статью "Как стать хакером", и в ней, помимо других
вещей, он советует будущим хакерам, какие языки они должны выучить. Для начала Реймонд
предлагает начать с Python и Java, так как они просты для изучения. Серьезный хакер
также выучит С для того, чтобы покопаться в глубинах Unix, и Perl для системного
администрирования системы и создания cgi-скриптов. В конце концов, истинный хакер
должен подумать об изучении Lisp'а: Lisp стоит выучить ради того глубокого прозрения,
которое вы приобретете в результате; этот опыт сделает вас лучше как программиста до
конца ваших дней, даже если сам Lisp вы практически не будете использовать.
</p>

<p>
Это тот же аргумент, который мы постоянно слышим в пользу изучения латыни. Вас не
возьмут на работу благодаря лишь ее знанию, разве что преподавателем классической
литературы, но это натренирует ваш ум, и вы станете лучше писать на тех языках, которые
вы хотите использовать, например, на английском.
</p>

<p>
Однако, секундочку. А ведь эта метафора не распространяется так далеко. Причина, по
которой вы не получите работу с латынью, заключается в том, что на ней никто не
говорит. Если вы будете писать на латыни, вас никто не поймет. Но Lisp — это
компьютерный язык, а компьютер говорит на том языке, на котором вы, программист,
прикажете ему говорить.
</p>

<p>
Значит, если Lisp, по словам Реймонда, сделает вас лучше как программиста, почему бы
его не использовать? Мне кажется, что если бы художнику предложили кисть, которая
позволила бы ему стать еще более хорошим художником, разве не захотел бы он
пользоваться ею при написании всех картин, не правда ли?
</p>

<p>
Я не пытаюсь высмеять Эрика Реймонда. В целом, его совет хорош. То, что он говорит о
Lisp'е, — общепринятое мнение: Lisp усовершенствует ваши профессиональные качества, но
тем не менее вы не станете его использовать.
</p>

<p>
Но почему нет? Языки программирования — это, в конце концов, просто инструменты. И если
Lisp способствует написанию лучших программ, то следует его использовать. Ну а если
нет, то кому он тогда нужен?
</p>

<p>
Это не только теоретический вопрос. Программное обеспечение — бизнес с жесткой
конкуренцией, бизнес, склонный к естественным монополиям. Компания, в которой пишут
софт быстрее и лучше, при прочих равных условиях вытеснит конкурентов.
</p>

<p>
Когда вы основываете компанию, то особенно остро ощущаете это. Либо вы разбогатеете,
либо не получите ничего. Если в вашем начинании вы поставите не на ту технологию, ваши
конкуренты не оставят от вас и мокрого места.
</p>

<p>
Мы с Робертом оба хорошо знали Lisp, и у нас не было причин не доверять своим
инстинктам и не воспользоваться им. Мы знали, что все остальные пишут на C++ или
Perl. Но мы также знали, что это ничего не значит. Если выбирать технологию по тому же
принципу, то операционной системой была бы Windows. При выборе технологии нужно
обращать внимание не на то, что делают остальные, нужно выбирать то, что будет лучше
работать.
</p>

<p>
Это особенно важно для компании-новичка. В большой компании можно делать то же, что
делают другие большие компании. Но начинающая компания не может себе позволить
повторять действия других таких же новичков. Я думаю, что немногие понимают это, даже
среди тех, кто открывают новый бизнес.
</p>

<p>
Средняя компания большого уровня растет примерно на 10 процентов в год, так что если вы
управляете такой компанией и поступаете так, как поступает средний руководитель этого
сектора, то можете ожидать такого же прироста — примерно 10 процентов в год.
</p>

<p>
Конечно, то же самое справедливо и для новых компаний — если вы поступаете так, как
поступает средняя компания, следует ожидать среднего результата.
</p>

<p>
Проблема в том, что со средним уровнем отдачи на начальном этапе вы вылетите из
бизнеса. Уровень выживаемости среди новых компаний меньше 50 процентов. Так что если вы
основали новое дело, лучше делать что-то необычное. Иначе вы в беде.
</p>

<p>
В 1995 году мы знали то, что, как мне кажется, наши конкуренты не понимали, а многие не
понимают даже сейчас: если вы создаете программное обеспечение, которое будет работать
на сервере, вы вольны использовать любой язык, который хотите. В деле создания программ
для десктопа присутствует тенденция разрабатывать программы на языке операционной
системы. Десять лет тому назад "писать программы" значило "писать на С". Но для
веб-приложений вы вольны выбирать тот язык, который хотите, особенно если у вас есть
исходный код языка и операционной системы.
</p>

<p>
Однако эта новая свобода — палка о двух концах. Теперь, когда вы можете использовать
любой язык, нужно думать о том, какой же язык выбрать. Компании, которые делают вид,
что ничего не изменилось, рискуют обнаружить, что их соперники так не считают.
</p>

<p>
Если можно использовать любой язык, какой выбрать? Мы выбрали Lisp. Было ясно, что
быстрая разработка важна на этом рынке. Все мы начинали с нуля, поэтому компания,
которая добавляет новую функциональность быстрее других, будет иметь серьезное
преимущество.
</p>

<p>
Мы знали, что Lisp — действительно очень хороший язык для быстрого создания программ, а
серверные приложения еще сильнее увеличивают эффект быстрой разработки, потому что
можно использовать программу через минуту после того, как она написана.
</p>

<p>
Если другие компании не хотели использовать Lisp, это было лишь преимуществом для
нас. Lisp мог дать нам технологическое превосходство — а нам было важно любое доступное
подспорье.
</p>

<p>
Когда мы основали Viaweb, у нас не было опыта в бизнесе. Мы ничего не знали о
маркетинге, о том, как нанимать людей, как зарабатывать деньги или привлекать
клиентов. Ни у кого из нас не было прежде того, что можно назвать настоящей
работой. Единственное, что мы умели — это писать программы. Мы надеялись, что это нас
выручит. Мы были готовы воспользоваться любой возможностью получить преимущество в
софтверном бизнесе.
</p>

<p>
Использование Lisp'а можно было назвать экспериментом. Гипотеза заключалась в том, что
если мы будем писать на Lisp'е, мы сможем расширять функциональность быстрее
конкурентов, и наш продукт будет способен на трюки, недоступные им. А так как Lisp —
язык очень высокого уровня, то нам не будет нужна большая команда разработчиков —
соответственно и затраты будут ниже.
</p>

<p>
В этом случае мы сможем предложить лучший продукт за меньшие деньги, и при этом
получить прибыль. При оптимальном развитии событий мы должны были привлечь всех
клиентов, не оставив никого конкурентам, которым пришлось бы в конце концов уйти из
бизнеса. По крайней мере, мы надеялись, что так произойдет.
</p>

<p>
Каковы же были результаты эксперимента? К удивлению, наша гипотеза себя оправдала. Со
временем у нас было много конкурентов, порядка двадцати — тридцати, но ни у одного из
них не было продукта, способного соперничать с нашим. У нас была WYSIWYG-программа для
создания онлайновых магазинов, которая работала на сервере, и тем не менее, выглядела
как обычное приложение. У наших соперников были CGI скрипты.
</p>

<p>
Мы всегда были впереди конкурентов по функциональности. Иногда, в порыве отчаяния, они
пытались добавить новую функцию, которой не было у нас. Однако с Lisp'ом наш цикл
разработки был настолько коротким, что мы могли воспроизвести аналогичную возможность в
течение дня или двух после того, как конкурент объявлял о ней в пресс-релизе. К тому
моменту, когда журналисты, занимающиеся пресс-релизом, звонили нам, у нас было все то
же самое.
</p>

<p>
Должно быть, нашим конкурентам казалось, что мы владели неким секретным оружием,
например перехватывали их закрытую переписку или что-то в этом роде. На самом деле у
нас было секретное оружие, но гораздо более простое, чем могло показаться. Не было
никакой утечки информации. Просто мы могли разрабатывать наш продукт быстрее, чем это
казалось возможным.
</p>

<p>
Когда мне было девять, мне в руки попала книга Фредерика Форсайта, "День
Шакала". Главный герой книги — киллер, которого наняли для того, чтобы убить президента
Франции. Убийце нужно было пробраться мимо полиции, чтобы попасть в квартиру, откуда
открывается вид на дорогу, по которой проходит маршрут президента. Киллер прошел мимо
полиции на костылях, одетый стариком, и его никто не заподозрил.
</p>

<p>
Это напоминает наше "секретное оружие". Мы писали наш продукт на причудливом языке со
странным синтаксисом, полным скобок, на языке, популярном в сфере Искусственного
Интеллекта. Годами такое определение Lisp'а вызывало у меня раздражение. Но теперь это
работало в нашу пользу.
</p>

<p>
В бизнесе нет ничего более ценного, чем техническое преимущество, которого не понимают
ваши конкуренты. В бизнесе, как и на войне, сюрприз стоит столько же, сколько сила.
</p>

<p>
Я слегка смущен, но признаюсь, что никогда открыто не говорил о Lisp'е в то время,
когда мы работали над Viaweb. Мы никогда не упоминали его в прессе, и если бы вы искали
следы Lisp'а на нашем сайте, все, что вы бы нашли, это названия двух моих книг и мою
биографию. И это не случайность. Начинающая компания должна давать своим конкурентам
настолько мало информации, насколько это возможно. И если они не знали, на каком языке
был написан наш софт, или им было все равно, я предпочел оставить все как есть.
</p>

<p>
Роберт Моррис говорит, что мне не нужно было скрытничать, потому что даже если бы наши
конкуренты узнали, что мы используем Lisp, они бы не поняли, почему: "Если бы они были
настолько умными, чтобы понять это, они бы уже писали на Lisp'е."
</p>

<p>
Лучше всего понимали нашу технологию наши клиенты. Им было все равно, на каком языке
был написана наша программа, но они отметили, что работает он на самом деле
хорошо. Программа Viaweb позволяла им создавать замечательно выглядящие
интернет-магазины буквально за минуты. Таким образом, у нас появлялось все больше
пользователей, в основном за счет распространения личного мнения наших клиентов.
</p>

<p>
К концу 1996 у нас было примерно 70 онлайновых магазинов. К концу 1996 их
было 500. Шесть месяцев спустя, когда нас приобрел Yahoo, у нас было 1070
пользователей. Сегодня, под именем Yahoo Store, этот продукт продолжает господствовать
на своем рынке. Это одна из наиболее прибыльных частей Yahoo, и магазины, построенные с
его помощью, — это основа Yahoo Shopping. Я покинул Yahoo в 1999, и поэтому не знаю
точно, сколько у них пользователей сейчас, но последние цифры, которые я слышал, — это
около 14 тысяч пользователей.
</p>

<p>
Люди спрашивают меня, используется ли Lisp сейчас в Yahoo Store. Да, весь Lisp код все
еще там. В Yahoo на серверах работает софт, написанный на всех пяти языках, которые
советует хакерам Эрик Реймонд.
</p>
</div>
</div>
