org/holy/avg.org
** Айкидо для начинающих компаний

Однако я не думаю, что смогу убедить кого-нибудь (старше 25) выучить Lisp.
Цель этой статьи — не изменить чье-то решение, а вдохновить тех, кто уже заинтересован
в использовании Lisp'а — тех, кто знает, что Lisp — это мощный язык, но беспокоятся
из-за того, что Lisp мало используется. В случае конкуренции это преимущество. Мощь
Lisp'а умножается тем фактом, что ваши конкуренты этого не понимают.

Если вы раздумываете над использованием Lisp'а в новом бизнесе, не стоит беспокоиться о
том, что большинство не понимает этот язык. Вам нужно надеяться на то, что так все и
останется. А так оно скорее всего и будет. Большинство довольны тем, что они используют
— это природа языков программирования. Компьютерное железо изменяется настолько быстрее
личных привычек, что практика программирования обычно отстает от процессора на десять —
двадцать лет. В таких местах как MIT писали на высокоуровневых языках уже в начале
60-х, но многие компании продолжали писать на машинных кодах вплоть до 80-х. Бьюсь об
заклад, что многие продолжали писать на машинных кодах до тех пор, пока процессор,
словно бармен, собирающийся закрыть бар и пойти домой, не выдворил их прочь,
переключившись на набор команд RISC.

Обычно технология меняется быстро. Однако с языками программирования все по-другому —
они не просто технология, они воплощают собой способ мышления программистов. Это
наполовину технология, наполовину религия. В результате сравнения языков
программирования принимают форму либо религиозных войн, либо университетских учебников,
настолько нейтральных, что они похожи на труды по антропологии. Те, кто желают
спокойствия, избегают столь острой темы. Однако вопрос религиозен лишь наполовину, этот
вопрос изучить не помешает, особенно если вы собираетесь создавать новый язык
программирования. Средний язык — это язык, которым пользуется средний
программист. Движется он медленно, как айсберг. "Сборка мусора" (Garbage Collection),
впервые введенная в употребление в Lisp'е примерно в 1960 году, сейчас повсеместно
признается хорошей штукой. Динамическая типизация также становится все более
популярной. Лексические замыкания, введенные в употребление Lisp'ом в начале
семидесятых, сейчас едва видны на экране радара. Макросы, появившиеся в Lisp'е в
середине шестидесятых, до сих пор — терра инкогнита.

Очевидно, что средний язык обладает мощной инерцией. Я не предлагаю
вам сопротивляться этой силе. Я предлагаю совершенно обратное — подобно практикующему
айкидо, воспользоваться этой силой против своих противников.

Если вы работаете в большой компании, это может быть не так просто. Вам будет трудно
убедить своего косного босса позволить вам программировать на Lisp'е, особенно если тот
только что прочитал в газете о каком-то языке, который, как и Ада двадцать лет тому
назад, готов завоевать мир. Но если вы работаете в начинающей компании, в которой еще
нет такого босса, вы можете, как это сделали мы, извлечь выгоду из парадокса Блаба:
использовать технологию, которой ваши конкуренты, неотрывно привязанные к своему
среднему языку, не смогут ничего противопоставить.

Если уж довелось работать в начинающей компании, есть неплохая подсказка, как оценивать
конкурентов. Прочитайте список их вакансий. Все другое на их сайте может быть сплошным
сочинительством, и лишь описания требуемых специалистов должны быть точными, иначе они
наймут не того кандидата, что им нужен.

За те годы, что я проработал в Viaweb, я прочитал множество объявлений о найме на
работу. Примерно каждый месяц появлялся новый конкурент. Первое, что я делал после
того, как проверял, доступна ли онлайновая демонстрация работы их программы, — смотрел
список их вакансий. Через пару лет я научился отличать опасных конкурентов от
неопасных. Чем больше отдавало IT-мэйнстримом от описания требуемых кандидатур, тем
менее опасна была компания. Самыми безопасными были те, кому требовались специалисты по
Oracle. О таких не стоило беспокоиться. Также мы были спокойны, если требовались
разработчики на C++ или Java.

Если требовались программисты на Perl или Python, это уже было слегка пугающе — это
значило, что компанией или, по крайней мере, ее технической частью заправляли настоящие
хакеры. Если бы я когда-нибудь увидел объявление о найме на работу Lisp-хакеров, я бы
обеспокоился не на шутку.

Пол Грэм (Paul Graham), перевод Юрия Лейкинда.

В основе этой статьи — лекция, прочитанная в Кембридже на симпозиуме разработчиков,
проведенном Franz, Inc. 25-го марта 2001-го года.

Оригинал статьи можно найти по адресу: http://www.paulgraham.com/avg.html.
